.emacs_test.d/config.org
** Custom keystrokes
All (most) the custom key combinations that I use regularly.
#+BEGIN_SRC emacs-lisp
  ;; set up my own map for files, folder and windows
  (define-prefix-command 'z-map)
  (global-set-key (kbd "C-z") 'z-map)
  (define-key z-map (kbd "a") 'org-agenda-show-agenda-and-todo)
  (define-key z-map (kbd "c") 'avy-goto-char)
  (define-key z-map (kbd "n") 'narrow-or-widen-dwim)
  (define-key z-map (kbd "t") 'toggle-transparency)
  (define-key z-map (kbd "e") 'config-visit)
  (define-key z-map (kbd "E") 'config-custom-visit)
  (define-key z-map (kbd "r") 'config-reload)
  (define-key z-map (kbd "<left>") 'shrink-window-horizontally)
  (define-key z-map (kbd "<right>") 'enlarge-window-horizontally)
  (define-key z-map (kbd "<down>") 'shrink-window)
  (define-key z-map (kbd "<up>") 'enlarge-window)
  (define-key z-map (kbd "C-<up>") 'buf-move-up)
  (define-key z-map (kbd "C-<down>") 'buf-move-down)
  (define-key z-map (kbd "C-<left>") 'buf-move-left)
  (define-key z-map (kbd "C-<right>") 'buf-move-right)

  ;; ORG extra keybinding
  ;; Store a reference link to an org mode location
  (global-set-key (kbd "C-c l") 'org-store-link)

  ;; Add an extra cursor above or below current cursor
  (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
  (global-set-key (kbd "C->") 'mc/mark-next-like-this)

  ;; Remove an extra cursor above or below current cursor
  (global-set-key (kbd "C-,") 'mc/unmark-previous-like-this)
  (global-set-key (kbd "C-.") 'mc/unmark-next-like-this)

  ;; Skip a spot in adding a new cursor above or below
  (global-set-key (kbd "C-M-<") 'mc/skip-to-previous-like-this)
  (global-set-key (kbd "C-M->") 'mc/skip-to-next-like-this)

  ;; Mark all entries in current selection (useful if you want to rename a variable in the whole file)
  (global-set-key (kbd "C-M-,") 'mc/mark-all-like-this)

  ;; Create cursors on every line in selected area
  (global-set-key (kbd "C-M-.") 'mc/edit-lines)

  ;; Insert numbers with increased index for exery cursor (useful for lists)
  (global-set-key (kbd "C-;") 'mc/insert-numbers)

  ;; Same as numbers but then with letters
  (global-set-key (kbd "C-M-;") 'mc/insert-letters)

  ;; With control shift and a mouse-click add cursor
  (global-set-key (kbd "C-S-<mouse-1>") 'mc/add-cursor-on-click)
#+END_SRC
** Exporting
*** Org to latex blank lines
Here we make a small adaption in exporting to latex file. A double newline is translated to a bigskip, thus creating an extra whitespace in the resulting pdf.
#+BEGIN_SRC emacs-lisp
  ;; replace \n\n with bigskip
  (defun my-replace-double-newline (backend)
    "replace multiple blank lines with bigskip"
    (interactive)
    (goto-char (point-min))
    (while (re-search-forward "\\(^\\s-*$\\)\n\n+" nil t)
      (replace-match "\n#+LATEX: \\par\\vspace{\\baselineskip}\\noindent\n" nil t)
      ;;(replace-match "\n#+LATEX: \\bigskip\\noindent\n" nil t)
      (forward-char 1)))

  (add-hook 'org-export-before-processing-hook 'my-replace-double-newline)
#+END_SRC
*** Export to word
Make sure that export (C-e) to odt, will be formatted to a .doc document for word.
#+BEGIN_SRC emacs-lisp
  ;; This setup is tested on Emacs 24.3 & Emacs 24.4 on Linux/OSX
  ;; org v7 bundled with Emacs 24.3
  (setq org-export-odt-preferred-output-format "doc")
  ;; org v8 bundled with Emacs 24.4
  (setq org-odt-preferred-output-format "doc")
  ;; BTW, you can assign "pdf" in above variables if you prefer PDF format

  ;; Only OSX need below setup
  (defun my-setup-odt-org-convert-process ()
    (setq process-string "/Applications/LibreOffice.app/Contents/MacOS/soffice --headless --convert-to %f%x --outdir %d %i")
    (interactive)
    (let ((cmd libre-office-path))
      (when (and (eq system-type 'darwin) (file-exists-p cmd))
	;; org v7
	(setq org-export-odt-convert-processes '(("LibreOffice" "/Applications/LibreOffice.app/Contents/MacOS/soffice --headless --convert-to %f%x --outdir %d %i")))
	;; org v8
	(setq org-odt-convert-processes '(("LibreOffice"  "/Applications/LibreOffice.app/Contents/MacOS/soffice --headless --convert-to %f%x --outdir %d %i"))))
      ))
  (my-setup-odt-org-convert-process)
#+END_SRC
*** Reveal.js
Provide the option to export (C-e) an org-file to a reveal presentation.
#+BEGIN_SRC emacs-lisp
  (use-package ox-reveal
  :ensure ox-reveal)
  (setq org-reveal-mathjax t)
  (use-package htmlize :ensure t)
#+END_SRC
*** Export to subdirectory
Exporting brings about a lot of extra files and mess in the folder of your org file. This function checks if there is an exported-org-files folder, if not, it makes it, and every exported file is put in there.
#+BEGIN_SRC emacs-lisp
  (defun org-export-output-file-name-modified (orig-fun extension &optional subtreep pub-dir)
    (unless pub-dir
      (setq pub-dir "exported-org-files")
      (unless (file-directory-p pub-dir)
	(make-directory pub-dir)))
    (apply orig-fun extension subtreep pub-dir nil))
  (advice-add 'org-export-output-file-name :around #'org-export-output-file-name-modified)
#+END_SRC
*** Beamer
#+BEGIN_SRC emacs-lisp
  (require 'ox-beamer)
#+END_SRC
** Gimmicks
Just some small functions that can be used for (almost) useless things.
*** Transparency
#+BEGIN_SRC emacs-lisp
  ;;(set-frame-parameter (selected-frame) 'alpha '(<active> . <inactive>))
  ;;(set-frame-parameter (selected-frame) 'alpha <both>)
  (set-frame-parameter (selected-frame) 'alpha '(100 . 100))
  (add-to-list 'default-frame-alist '(alpha . (100 . 100)))

  (defun toggle-transparency ()
     (interactive)
     (let ((alpha (frame-parameter nil 'alpha)))
       (set-frame-parameter
        nil 'alpha
        (if (eql (cond ((numberp alpha) alpha)
                       ((numberp (cdr alpha)) (cdr alpha))
                       ;; Also handle undocumented (<active> <inactive>) form.
                       ((numberp (cadr alpha)) (cadr alpha)))
                 100)
            '(95 . 95) '(100 . 100)))))
#+END_SRC
** Navigation
*** avy
Avy is a powerful search package that lets you quickly navigate to wherever in your screen you want to go.
#+BEGIN_SRC emacs-lisp
  (use-package avy :ensure t)
#+END_SRC
*** Multiple Cursors
Use multi cursor editing easily. For keybindings, see [[*Custom keystrokes][Custom keystrokes]].
#+BEGIN_SRC emacs-lisp
  (require 'multiple-cursors)
#+END_SRC
** Org
*** Org-bullets
Small package that makes the org hierachy a little bit more appealing. The stars are changed into icons for example.
#+BEGIN_SRC emacs-lisp
  (use-package org-bullets
    :ensure t
    :config
    (add-hook 'org-mode-hook (lambda () (org-bullets-mode))))
#+END_SRC
*** Writing improvements
Some of the adjustments are *stolen* from [[https://explog.in/notes/writingsetup.html][this guy]]. It mainly revolves around using screenspace efficiently instead of randomly adding whitespace, or not displaying whitespace where there actually is whitespace.
#+BEGIN_SRC emacs-lisp
  (setq org-indent-indentation-per-level 1)             ;; Shorten the space on the left side with org headers
  (setq org-adapt-indentation nil)                      ;; Adapt indentation to outline node level. Set to nill as it takes up space.
  (setq org-hide-emphasis-markers t)                    ;; When making something bold *Hallo*, hide stars. Goes for all emphasis markers.
  (setq org-cycle-separator-lines 1)                    ;; Leave a single empty line between headers if there is one. Otherwise leave no room or make the empty lines belong to the previous header.
  (setq org-hide-leading-stars 't)                      ;; Hide the extra stars in front of a header (org-bullet displays nicer, but why add extra package)
  (customize-set-variable 'org-blank-before-new-entry 
                          '((heading . nil)
                            (plain-list-item . nil)))   ;; Dont randomly remove newlines below headers
#+END_SRC
*** Image size
Make standard size for org images. Otherwise they can become gigantic!
#+BEGIN_SRC emacs-lisp
    (setq org-image-actual-width 600)
#+END_SRC
*** Org-babel
#+BEGIN_SRC emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((python . t)))
#+END_SRC
** Standards (minor modes and minor improvements)
*** Alter annoying defaults
Small defaults to be changed as minor improvements. The changes are summarized next to it.
#+BEGIN_SRC emacs-lisp
  (setq save-interprogram-paste-before-kill t) ;; Perpetuates system clipboard
  (setq scroll-conservatively 1)      ;; Keep from making huge jumps when scrolling
  (setq ring-bell-function 'ignore)   ;; Unable annoying sounds
  (setq visible-bell 1)               ;; disable annoying windows sound
  (setq inhibit-startup-message t)    ;; Hide the startup message
  (setq display-time-24hr-format t)   ;; Format clock
  (setq-default display-line-numbers 'relative) ;; Setting the line numbers
  (when window-system (global-hl-line-mode t)) ;; Get a current line shadow in IDE
  (defalias 'yes-or-no-p 'y-or-n-p)   ;; Replace yes questions to y
#+END_SRC
*** Hungry-delete
Deletes all whitespace with a single delete of backspace.
#+BEGIN_SRC emacs-lisp
  (use-package hungry-delete
    :ensure t
    :config (global-hungry-delete-mode))
#+END_SRC
