.emacs_test.d/config.org
*** Minor modes
Some minor modes that are turned on or off. Next to each, a short description is given of what it changes.
#+BEGIN_SRC emacs-lisp
  (tool-bar-mode -1)                  ;; Get rid of tool-bar
  (menu-bar-mode -1)                  ;; Git rid of menu
  (scroll-bar-mode -1)                ;; Get rid of scroll-bar
  (global-auto-revert-mode 1)         ;; Make sure that you're always looking at the latest version of a file. Change file when changed on disk
  (delete-selection-mode 1)           ;; Remove text from selection instead of just inserting text
  (display-time-mode 1)               ;; Set clock on lower right side
  (electric-pair-mode t)              ;; Enable electric pair mode. It autocompletes certain pairs. E.g., (), {}, [], <>
  (global-subword-mode 1)             ;; Cause M-f to move forward per capitalization within a word. E.g., weStopAtEveryCapital
  (global-visual-line-mode 1)                ;; Make sure that lines do not disapear at the right side of the screen but wrap around
#+END_SRC
*** Popup kill-ring
Show options out of the kill ring instead of cycling through each option.
#+BEGIN_SRC emacs-lisp
  (use-package popup-kill-ring
    :ensure t
    :bind ("M-y" . popup-kill-ring))
#+END_SRC
*** Which key
Provides options for keystrokes. Super useful!
#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :ensure t
    :init
    (which-key-mode))
#+END_SRC
*** TODOS
#+BEGIN_SRC emacs-lisp
  (setq org-todo-keyword-faces
        '(
          ("DOING" . (:foreground "#05d3fc" :weight bold :box (:line-width 2 :style released-button)))
          ("WAITING" . (:foreground "#fcca05" :weight bold :box (:line-width 2 :style released-button)))
          ("FLEETING" . (:foreground "#f62af9" :weight bold :box (:line-width 2 :style released-button)))
          ("LONGTERM" . (:foreground "#c4013c" :weight bold :box (:line-width 2 :style released-button)))
          ("CANCELED" . (:foreground "#fc4205" :weight bold :box (:line-width 2 :style released-button)))
          ))

  (setq org-todo-keywords
        '((sequence "TODO(t)" "DOING(d)" "WAITING(w)" "FLEETING(f)" "|" "LONGTERM(l)" "CANCELED(c)" "DONE(f)")))
#+END_SRC
** Try package
Have the option to try packages without actually installing them. If you do

#+BEGIN_SRC
M-x try
#+END_SRC

It will give you the option to temporarily install the package. If you close and reopen emacs, the tried out package is removed.

#+BEGIN_SRC emacs-lisp
  (use-package try
      :ensure t)
#+END_SRC
** Visual
*** Beacon
Small package to provide an idea where in which buffer the cursor is atm by showing a small light in the current frame.
#+BEGIN_SRC emacs-lisp
  (use-package beacon
      :ensure t
      :init
      (beacon-mode 1))
#+END_SRC
*** rainbow
Visualize color codings. So RGB will be colored in its respective color.
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-mode
    :ensure t
    :init (add-hook 'prog-mode-hook 'rainbow-mode))
#+END_SRC

Make visual pairs of delimeters ({<[]>}) etc. Each level gets its own color so it's easy to spot which are pairs.
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-delimiters
    :ensure t
    :init
    (rainbow-delimiters-mode 1))
#+END_SRC
*** Doom theme
This causes emacs to look a lot better overall. [[https://github.com/hlissner/emacs-doom-themes][This package]] makes the coloring and font decissions, so you don't have to. There is a seperate package for the mode-line (the line that containts the time and which file etc.)
#+BEGIN_SRC emacs-lisp
  (use-package doom-themes
    :ensure t
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled
    (load-theme 'doom-one t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)

    ;; Enable custom neotree theme (all-the-icons must be installed!)
    (doom-themes-neotree-config)
    ;; or for treemacs users
    (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
    (doom-themes-treemacs-config)

    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))

  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1))
#+END_SRC
*** all-the-icons
#+BEGIN_SRC emacs-lisp
  (use-package all-the-icons :ensure t)
#+END_SRC
* Shortcuts
Here I provide some common shortcuts that I tend to use or want to remember. 
** Shorthand notations
There are some shorthands for certain keys, these are as follows:
|-----------+----------------------------------------|
| Shorthand | Corresponding key                      |
|-----------+----------------------------------------|
| C         | Control                                |
| M         | Meta, option or alt (depending on OS)  |
| RET       | Return or enter                        |
| S         | Shift                                  |
| SPC       | Space bar                              |
| TAB       | Tab key                                |
| prefix    | C-u followed by the shortcut           |
| VERT      | This is a pipe sign |, it is described |
|           | like this since Org treats this as a   |
|           | new column                             |
|-----------+----------------------------------------|
** Navigation
|---------------+-------------------------------------------------------------|
| Shortcut      | Description                                                 |
|---------------+-------------------------------------------------------------|
| *Beginner*      |                                                             |
|---------------+-------------------------------------------------------------|
| PREFIX NUMBER | By typing the PREFIX (C-u) with a number after it followed  |
|               | by a command, you in principle repeat the command number of |
|               | times                                                       |
| C-n           | Move cursor down (next)                                     |
| C-p           | Move cursor up (previous)                                   |
| C-b           | Move cursor left (back)                                     |
| M-b           | Move cursor back one word                                   |
| C-f           | Move cursor right (forward)                                 |
| M-f           | Move cursor forward one word                                |
| C-a           | Move cursor to beginning of line                            |
| M-a           | Move cursor to beginning of current or previous sentence    |
| C-e           | Move cursor to end of line                                  |
| M-e           | Move cursor to end of current or next sentence              |
| M-{           | Move cursor to beginning or previous paragraph              |
| M-}           | Move cursor to end or next paragraph                        |
|---------------+-------------------------------------------------------------|
| *Intermediate*  |                                                             |
|---------------+-------------------------------------------------------------|
| M-g M-g       | Asks you a number and then goes to that line number         |
|               |                                                             |
|---------------+-------------------------------------------------------------|
** Org
*** Regular ORG
| Shortcut | Description                             |
|----------+-----------------------------------------|
| C-S-RET  | Add extra todo checklist item to a list |
| C-RET    | Add extra item to a list                |
|----------+-----------------------------------------|
*** Tables
Here are some shortcuts that I regularly use or want to have handy nearby. For a more exhaustive list, check [[https://orgmode.org/manual/Built_002din-Table-Editor.html#Built_002din-Table-Editor][the org table manual]].

|------------------------+------------------------------------------------------------------------|
| Shortcut               | Description                                                            |
|------------------------+------------------------------------------------------------------------|
| *Re-aligning and motion* |                                                                        |
|------------------------+------------------------------------------------------------------------|
| C-c C-c                | Re-align without moving                                                |
| TAB                    | Re-align table, move to next field and create new row if needed        |
| RET                    | Move cursor to next row or create a row (useful with horizontal lines) |
| M-a or M-e             | Move to beginning or end of current field, or next field               |
|------------------------+------------------------------------------------------------------------|
| *Regions*                |                                                                        |
|------------------------+------------------------------------------------------------------------|
| M-RET                  | Split current field at point and paste what comes after to new line    |
|------------------------+------------------------------------------------------------------------|
| *Column and Row editing* |                                                                        |
|------------------------+------------------------------------------------------------------------|
| C-c RET                | Insert horizontal line                                                 |
| C-c -                  | Insert a horizontal line below, with prefix it is above                |
| C-c ^                  | Sort by column on point                                                |
| S-ARROW_KEY            | Move current cell in the direction of the used arrow key               |
| M-ARROW_KEY            | Move current column or row in the direction of the used arrow key      |
| M-S-LEFT or M-S-UP     | Kill current column or row, respectively                               |
| M-S-RIGHT or M-S-DOWN  | Add column or row                                                      |
|------------------------+------------------------------------------------------------------------|
| *Calculations*           |                                                                        |
|------------------------+------------------------------------------------------------------------|
| C-c +                  | You can paste (C-y) a column sum into a field                          |
| S-RET                  | Auto-increment downward is current field is a number or if current     |
|                        | is empty, copy the one from above.                                     |
|------------------------+------------------------------------------------------------------------|
| *Misc*                   |                                                                        |
|------------------------+------------------------------------------------------------------------|
| C-c VERT               | Create table or convert from region (csv style)                        |
| C-c `                  | Used if you want a seperate buffer to alter a field                    |
|------------------------+------------------------------------------------------------------------|
*** Exporting
